In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("PEA11.20231025T121029.csv")

In [3]:
data.head()

,STATISTIC Label,Year,Single Year of Age,Sex,UNIT,VALUE
0,Population estimates from 1926,1926,All ages,Both sexes,Number,2971992
1,Population estimates from 1926,1926,All ages,Male,Number,1506889
2,Population estimates from 1926,1926,All ages,Female,Number,1465103
3,Population estimates from 1926,1926,Under 1 year,Both sexes,Number,55391
4,Population estimates from 1926,1926,Under 1 year,Male,Number,28084

In [4]:
data.tail

<bound method NDFrame.tail of                       STATISTIC Label  Year Single Year of Age         Sex  \
0      Population estimates from 1926  1926           All ages  Both sexes
1      Population estimates from 1926  1926           All ages        Male
2      Population estimates from 1926  1926           All ages      Female
3      Population estimates from 1926  1926       Under 1 year  Both sexes
4      Population estimates from 1926  1926       Under 1 year        Male
...                               ...   ...                ...         ...
11812  Population estimates from 1926  2023           98 years        Male
11813  Population estimates from 1926  2023           98 years      Female
11814  Population estimates from 1926  2023  99 years and over  Both sexes
11815  Population estimates from 1926  2023  99 years and over        Male
11816  Population estimates from 1926  2023  99 years and over      Female

         UNIT    VALUE
0      Number  2971992
1      Number  1506889
2      Number  1465103
3      Number    55391
4      Number    28084
...       ...      ...
11812  Number      197
11813  Number      632
11814  Number     1600
11815  Number      352
11816  Number     1248

[11817 rows x 6 columns]>

In [5]:
data.info

<bound method DataFrame.info of                       STATISTIC Label  Year Single Year of Age         Sex  \
0      Population estimates from 1926  1926           All ages  Both sexes
1      Population estimates from 1926  1926           All ages        Male
2      Population estimates from 1926  1926           All ages      Female
3      Population estimates from 1926  1926       Under 1 year  Both sexes
4      Population estimates from 1926  1926       Under 1 year        Male
...                               ...   ...                ...         ...
11812  Population estimates from 1926  2023           98 years        Male
11813  Population estimates from 1926  2023           98 years      Female
11814  Population estimates from 1926  2023  99 years and over  Both sexes
11815  Population estimates from 1926  2023  99 years and over        Male
11816  Population estimates from 1926  2023  99 years and over      Female

         UNIT    VALUE
0      Number  2971992
1      Number  1506889
2      Number  1465103
3      Number    55391
4      Number    28084
...       ...      ...
11812  Number      197
11813  Number      632
11814  Number     1600
11815  Number      352
11816  Number     1248

[11817 rows x 6 columns]>

In [6]:
data.shape

(11817, 6)

In [7]:
data.describe()

               Year         VALUE
count  11817.000000  1.181700e+04
mean    1996.410256  5.352461e+04
std       24.463165  2.867754e+05
min     1926.000000  6.000000e+00
25%     1986.000000  1.242700e+04
50%     2004.000000  2.667500e+04
75%     2014.000000  3.557700e+04
max     2023.000000  5.281612e+06

In [8]:
data.isnull().sum()

STATISTIC Label       0
Year                  0
Single Year of Age    0
Sex                   0
UNIT                  0
VALUE                 0
dtype: int64

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11817 entries, 0 to 11816
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   STATISTIC Label     11817 non-null  object
 1   Year                11817 non-null  int64
 2   Single Year of Age  11817 non-null  object
 3   Sex                 11817 non-null  object
 4   UNIT                11817 non-null  object
 5   VALUE               11817 non-null  int64
dtypes: int64(2), object(4)
memory usage: 554.0+ KB

In [10]:
data["Single Year of Age"].unique()

array(['All ages', 'Under 1 year', '1 year', '2 years', '3 years',
       '4 years', '5 years', '6 years', '7 years', '8 years', '9 years',
       '10 years', '11 years', '12 years', '13 years', '14 years',
       '15 years', '16 years', '17 years', '18 years', '19 years',
       '20 years', '21 years', '22 years', '23 years', '24 years',
       '25 years', '26 years', '27 years', '28 years', '29 years',
       '30 years', '31 years', '32 years', '33 years', '34 years',
       '35 years', '36 years', '37 years', '38 years', '39 years',
       '40 years', '41 years', '42 years', '43 years', '44 years',
       '45 years', '46 years', '47 years', '48 years', '49 years',
       '50 years', '51 years', '52 years', '53 years', '54 years',
       '55 years', '56 years', '57 years', '58 years', '59 years',
       '60 years', '61 years', '62 years', '63 years', '64 years',
       '65 years', '66 years', '67 years', '68 years', '69 years',
       '70 years', '71 years', '72 years', '73 years', '74 years',
       '75 years', '76 years', '77 years', '78 years', '79 years',
       '80 years', '81 years', '82 years', '83 years', '84 years',
       '85 years', '86 years', '87 years', '88 years', '89 years',
       '90 years', '91 years', '92 years', '93 years', '94 years',
       '95 years', '96 years', '97 years', '98 years',
       '99 years and over'], dtype=object)

In [11]:
values_to_remove =["All ages"]
data = data[~data["Single Year of Age"].isin(values_to_remove)]

In [12]:
##也可以用Drop来实现，但是实现的过程更复杂一些
##values_to_remove =["All ages"]
##indices_to_remove = df[df["Single Year of Age"].isin(values_to_remove)].index
##df =df.drop(indices_to_remove)

In [13]:
#ages = data["Single Year of Age"].unique()

#for i in ages:
    #if i[:1] == "U":
        #data.loc[data["Single Year of Age"] =="Under 1 year","Single Year of Age"] = 0.5
        #data["Single Year of Age"].replace("U",0.5,inplace = True)
    #else:
        #data.loc[data["Single Year of Age"] == i,"Single Year of Age"] = int(i[:2])
        #data["Single Year of Age"].replace(i,int(i[:2]),inplace = True)


#C:\Users\luozh\anaconda3\envs\py36\lib\site-packages\pandas\core\indexing.py:1763: SettingWithCopyWarning:         
#A value is trying to be set on a copy of a slice from a DataFrame.
#Try using .loc[row_indexer,col_indexer] = value instead
#See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
#isetter(loc, value)

In [14]:
class AgeDataProcessor:
    def __init__(self,data):
        self.data = data
        self.ages = data["Single Year of Age"].unique()
    
    def process_ages(self):
        for i in self.ages:
            if i[:1] == "U":
                self.data.loc[self.data["Single Year of Age"] =="Under 1 year","Single Year of Age"] = 0.5
            else:
                self.data.loc[self.data["Single Year of Age"] == i,"Single Year of Age"] = int(i[:2])
processor = AgeDataProcessor(data)
processor.process_ages()
print(data)

                      STATISTIC Label  Year Single Year of Age         Sex  \
3      Population estimates from 1926  1926                0.5  Both sexes
4      Population estimates from 1926  1926                0.5        Male
5      Population estimates from 1926  1926                0.5      Female
6      Population estimates from 1926  1926                  1  Both sexes
7      Population estimates from 1926  1926                  1        Male
...                               ...   ...                ...         ...
11812  Population estimates from 1926  2023                 98        Male
11813  Population estimates from 1926  2023                 98      Female
11814  Population estimates from 1926  2023                 99  Both sexes
11815  Population estimates from 1926  2023                 99        Male
11816  Population estimates from 1926  2023                 99      Female

         UNIT  VALUE
3      Number  55391
4      Number  28084
5      Number  27307
6      Number  55876
7      Number  28374
...       ...    ...
11812  Number    197
11813  Number    632
11814  Number   1600
11815  Number    352
11816  Number   1248

[11700 rows x 6 columns]

C:\Users\luozh\anaconda3\envs\py36\lib\site-packages\pandas\core\indexing.py:1763: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [15]:
data["Single Year of Age"]

3        0.5
4        0.5
5        0.5
6          1
7          1
        ...
11812     98
11813     98
11814     99
11815     99
11816     99
Name: Single Year of Age, Length: 11700, dtype: object

In [16]:
data.columns

Index(['STATISTIC Label', 'Year', 'Single Year of Age', 'Sex', 'UNIT',
       'VALUE'],
      dtype='object')

In [17]:
Data_male = data[data["Sex"] == "Male"]
Data_female = data[data["Sex"] == "Female"]

In [18]:
Data_male = Data_male.groupby("Year")["VALUE"].sum()
Data_male = Data_male.reset_index()
Data_male

    Year    VALUE
0   1926  1506889
1   1936  1520454
2   1946  1494877
3   1951  1506597
4   1961  1416549
5   1966  1449032
6   1971  1495760
7   1979  1693272
8   1981  1729354
9   1986  1769690
10  1991  1753418
11  1996  1800232
12  1997  1819394
13  1998  1838859
14  1999  1858613
15  2000  1882946
16  2001  1913128
17  2002  1946164
18  2003  1976914
19  2004  2011914
20  2005  2061831
21  2006  2117322
22  2007  2191275
23  2008  2238581
24  2009  2257342
25  2010  2262181
26  2011  2270506
27  2012  2275017
28  2013  2286131
29  2014  2299041
30  2015  2317718
31  2016  2346546
32  2017  2380827
33  2018  2419506
34  2019  2456306
35  2020  2491778
36  2021  2514023
37  2022  2561954
38  2023  2606170

In [32]:
Data_female = Data_female.groupby("Year")["VALUE"].sum()
Data_female = Data_female.reset_index()
Data_female

    Year    VALUE
0   1926  1465103
1   1936  1447966
2   1946  1460230
3   1951  1453996
4   1961  1401792
5   1966  1434970
6   1971  1482488
7   1979  1674945
8   1981  1714051
9   1986  1770953
10  1991  1772301
11  1996  1825855
12  1997  1844919
13  1998  1864223
14  1999  1883034
15  2000  1906590
16  2001  1934070
17  2002  1971039
18  2003  2002939
19  2004  2033274
20  2005  2072008
21  2006  2115607
22  2007  2184567
23  2008  2246489
24  2009  2276053
25  2010  2292582
26  2011  2304382
27  2012  2318680
28  2013  2328538
29  2014  2346399
30  2015  2370069
31  2016  2393051
32  2017  2430068
33  2018  2465390
34  2019  2502165
35  2020  2538097
36  2021  2560645
37  2022  2622012
38  2023  2675442

In [33]:
Data_sex = pd.merge(Data_male,Data_female,on = "Year",how = "inner",suffixes=("_Male", "_Female"))
Data_sex

    Year  VALUE_Male  VALUE_Female
0   1926     1506889       1465103
1   1936     1520454       1447966
2   1946     1494877       1460230
3   1951     1506597       1453996
4   1961     1416549       1401792
5   1966     1449032       1434970
6   1971     1495760       1482488
7   1979     1693272       1674945
8   1981     1729354       1714051
9   1986     1769690       1770953
10  1991     1753418       1772301
11  1996     1800232       1825855
12  1997     1819394       1844919
13  1998     1838859       1864223
14  1999     1858613       1883034
15  2000     1882946       1906590
16  2001     1913128       1934070
17  2002     1946164       1971039
18  2003     1976914       2002939
19  2004     2011914       2033274
20  2005     2061831       2072008
21  2006     2117322       2115607
22  2007     2191275       2184567
23  2008     2238581       2246489
24  2009     2257342       2276053
25  2010     2262181       2292582
26  2011     2270506       2304382
27  2012     2275017       2318680
28  2013     2286131       2328538
29  2014     2299041       2346399
30  2015     2317718       2370069
31  2016     2346546       2393051
32  2017     2380827       2430068
33  2018     2419506       2465390
34  2019     2456306       2502165
35  2020     2491778       2538097
36  2021     2514023       2560645
37  2022     2561954       2622012
38  2023     2606170       2675442

In [40]:
observed_male = Data_sex["VALUE_Male"]
observed_female = Data_sex["VALUE_Female"]

total = observed_male + observed_female

In [43]:
type(observed_male)

pandas.core.series.Series

In [39]:
from scipy.stats import binom_test

observed_male = Data_sex["VALUE_Male"]
observed_female = Data_sex["VALUE_Female"]

total = observed_male + observed_female

p = 0.5


p_value_male = binom_test(observed_male, n=total, p = p,alternative='two-sided') 
print("p value of Male:", p_value_male)


alpha = 0.05  
if p_value_male < alpha:
    print("Reject the null hypothesis: The distribution of male births does not conform to a binomial distribution ")
else:
    print("Not rejecting the null hypothesis: The distribution of female births conforms to a binomial distribution")

ValueError: Incorrect length for x.

In [45]:
import numpy as np
from scipy.stats import binom_test

# 假设你有观察到的男性和女性出生人口数据
observed_male_births = np.array([100, 120, 110, 95, 105])
observed_female_births = np.array([90, 110, 100, 105, 95])

# 总出生人口数
total_births = observed_male_births + observed_female_births

# 假设男性和女性出生率相等（期望的成功概率）
p = 0.5

# 计算期望的男性和女性出生人口数量
expected_male_births = total_births * p
expected_female_births = total_births * (1 - p)

# 执行二项分布检验，检查观察到的出生人口是否符合预期的二项分布
p_value_male = binom_test(observed_male_births, n=total_births, p=p, alternative='two-sided')
p_value_female = binom_test(observed_female_births, n=total_births, p=1 - p, alternative='two-sided')

# 输出检验结果
print("男性出生人口的p值:", p_value_male)
print("女性出生人口的p值:", p_value_female)

# 判断结果是否显著
alpha = 0.05  # 显著性水平
if p_value_male < alpha:
    print("拒绝原假设：男性出生人口分布不符合二项分布")
else:
    print("未拒绝原假设：男性出生人口分布符合二项分布")

if p_value_female < alpha:
    print("拒绝原假设：女性出生人口分布不符合二项分布")
else:
    print("未拒绝原假设：女性出生人口分布符合二项分布")

ValueError: Incorrect length for x.

In [22]:
from sklearn.preprocessing import OneHotEncoder

ohot = OneHotEncoder(sparse = False)

ohot.fit_transform(data[["Sex"]])

data = pd.get_dummies(data,prefix = "Sex",columns = ["Sex"])

data

,STATISTIC Label,Year,Single Year of Age,UNIT,VALUE,Sex_Both sexes,Sex_Female,Sex_Male
3,Population estimates from 1926,1926,0.5,Number,55391,1,0,0
4,Population estimates from 1926,1926,0.5,Number,28084,0,0,1
5,Population estimates from 1926,1926,0.5,Number,27307,0,1,0
6,Population estimates from 1926,1926,1,Number,55876,1,0,0
7,Population estimates from 1926,1926,1,Number,28374,0,0,1
...,...,...,...,...,...,...,...,...
11812,Population estimates from 1926,2023,98,Number,197,0,0,1
11813,Population estimates from 1926,2023,98,Number,632,0,1,0
11814,Population estimates from 1926,2023,99,Number,1600,1,0,0
11815,Population estimates from 1926,2023,99,Number,352,0,0,1
11816,Population estimates from 1926,2023,99,Number,1248,0,1,0

In [23]:
data = data.reset_index(drop=True)

In [24]:
data

,STATISTIC Label,Year,Single Year of Age,UNIT,VALUE,Sex_Both sexes,Sex_Female,Sex_Male
0,Population estimates from 1926,1926,0.5,Number,55391,1,0,0
1,Population estimates from 1926,1926,0.5,Number,28084,0,0,1
2,Population estimates from 1926,1926,0.5,Number,27307,0,1,0
3,Population estimates from 1926,1926,1,Number,55876,1,0,0
4,Population estimates from 1926,1926,1,Number,28374,0,0,1
...,...,...,...,...,...,...,...,...
11695,Population estimates from 1926,2023,98,Number,197,0,0,1
11696,Population estimates from 1926,2023,98,Number,632,0,1,0
11697,Population estimates from 1926,2023,99,Number,1600,1,0,0
11698,Population estimates from 1926,2023,99,Number,352,0,0,1
11699,Population estimates from 1926,2023,99,Number,1248,0,1,0

In [25]:
data.drop(["STATISTIC Label","UNIT"],axis = 1,inplace = True)

In [26]:
data =data[["Year","Single Year of Age","Sex_Both sexes","Sex_Female","Sex_Male","VALUE"]]

In [27]:
data

       Year Single Year of Age  Sex_Both sexes  Sex_Female  Sex_Male  VALUE
0      1926                0.5               1           0         0  55391
1      1926                0.5               0           0         1  28084
2      1926                0.5               0           1         0  27307
3      1926                  1               1           0         0  55876
4      1926                  1               0           0         1  28374
...     ...                ...             ...         ...       ...    ...
11695  2023                 98               0           0         1    197
11696  2023                 98               0           1         0    632
11697  2023                 99               1           0         0   1600
11698  2023                 99               0           0         1    352
11699  2023                 99               0           1         0   1248

[11700 rows x 6 columns]

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11700 entries, 0 to 11699
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                11700 non-null  int64
 1   Single Year of Age  11700 non-null  object
 2   Sex_Both sexes      11700 non-null  uint8
 3   Sex_Female          11700 non-null  uint8
 4   Sex_Male            11700 non-null  uint8
 5   VALUE               11700 non-null  int64
dtypes: int64(2), object(1), uint8(3)
memory usage: 308.6+ KB

In [29]:
data

       Year Single Year of Age  Sex_Both sexes  Sex_Female  Sex_Male  VALUE
0      1926                0.5               1           0         0  55391
1      1926                0.5               0           0         1  28084
2      1926                0.5               0           1         0  27307
3      1926                  1               1           0         0  55876
4      1926                  1               0           0         1  28374
...     ...                ...             ...         ...       ...    ...
11695  2023                 98               0           0         1    197
11696  2023                 98               0           1         0    632
11697  2023                 99               1           0         0   1600
11698  2023                 99               0           0         1    352
11699  2023                 99               0           1         0   1248

[11700 rows x 6 columns]

In [30]:
age_group_year

NameError: name 'age_group_year' is not defined

In [ ]:
age_group= data.groupby("Single Year of Age")["VALUE"].sum()

In [ ]:
type(age_group)

In [ ]:
age_group_df = age_group.reset_index()

In [ ]:
age_group_df

In [ ]:
bins = range(0, 110, 10)
labels = [f"{i}-{i+9}" for i in range(0, 100, 10)]
age_group_df['Single Year of Age'] = pd.cut(age_group_df['Single Year of Age'], bins=bins, labels=labels, right=False)

In [ ]:
grouped_population = age_group_df.groupby('Single Year of Age')['VALUE'].sum()

In [ ]:
grouped_population =grouped_population.reset_index()

In [ ]:
["VALUE"]

In [ ]:
grouped_population.plot(kind='bar', figsize=(10, 6))
plt.title('Population by Age Group')
plt.xlabel('Age Group')
plt.ylabel('Population Count')
plt.show()